export const welcomeCaption = [
  "💫 Добро пожаловать!",
  "",
  "Ищешь того самого незнакомца? 🤔",
  "Встретил(а) кого-то, но не решился(ась) подойти? 🥲",
  "Я помогу найти ⬇️⬇️⬇️"
].join("\n");

export const welcomeDetails = [
  "━━━━━━━━━━━━━━━",
  "",
  "Оставь здесь:",
  "1️⃣ Где?",
  "2️⃣ Когда?",
  "3️⃣ Как выглядел человек?",
  "",
  "📸 Можно прикреплять фото или видео — так шансы найти человека значительно выше!",
  "",
  "Кто знает, может, ваша история начнётся прямо здесь… 😍🥰",
  "",
  "━━━━━━━━━━━━━━━",
  "",
  "📩 Как опубликовать пост:",
  "Напишите мне — укажите текст, при необходимости прикрепите фото/видео.",
  "Я отправлю ваш пост на модерацию, и после проверки он появится в канале.",
  "",
  "━━━━━━━━━━━━━━━",
  "",
  "📜 ПРАВИЛА (обязательно к прочтению):",
  "",
  "🚫 СТРОГО ЗАПРЕЩЕНО:",
  "",
  "❌ Оскорбления и флейм",
  "❌ Политика и провокации",
  "❌ Спам и реклама без согласования с администрацией",
  "❌ Флуд (бессмысленные сообщения, спам символами)",
  "❌ Контент 18+ (взрослый и шок-контент)",
  "❌ Публикации, связанные с продажей или покупкой товаров",
  "",
  "⚠️ Нарушение правил ведёт к предупреждению или бану без предупреждения"
].join("\n");

export const botCommands = [
  { command: "rules", description: "Правила анонимных сообщений" },
  { command: "info", description: "Информация о боте" }
];

export const rulesMessage = "📜 ПРАВИЛА: \n  \n🚫 СТРОГО ЗАПРЕЩЕНО: \n \n❌ Оскорбления и флейм \n❌ Политика и провокации \n❌ Спам и реклама без согласования с администрацией \n❌ Флуд (бессмысленные сообщения, спам символами) \n❌ Контент 18+ (взрослый и шок-контент) \n❌ Публикации, связанные с продажей или покупкой товаров \n \n⚠️ Нарушение правил ведёт к предупреждению или бану без предупреждения";

export const infoMessage = "Ищешь того самого незнакомца?🤔 \nВстретил(а) кого-то, но не решился(ась) подойти?🥲 \nЯ помогу найти ⬇️⬇️⬇️ \n\nОставь здесь: \n\n1️⃣ Где?\n\n2️⃣ Когда? \n\n3️⃣ Как выглядел человек? \n\n📸 Можно прикреплять фото или видео — так шансы найти человека значительно выше!";
