export const welcomeCaption = [
  "💫 Добро пожаловать!",
  "",
  "Ищешь того самого незнакомца? 🤔",
  "Встретил(а) кого-то, но не решился(ась) подойти? 🥲",
  "Я помогу найти ⬇️⬇️⬇️"
].join("\n");

export const welcomeDetails = [
  "━━━━━━━━━━━━━━━",
  "",
  "Оставь здесь:",
  "1️⃣ Где?",
  "2️⃣ Когда?",
  "3️⃣ Как выглядел человек?",
  "",
  "📸 Можно прикреплять фото или видео: так шансы найти человека выше.",
  "",
  "Кто знает, может, ваша история начнётся прямо здесь… 😌🥰",
  "",
  "━━━━━━━━━━━━━━━",
  "",
  "📩 Как опубликовать пост:",
  "Напишите мне сообщение с текстом и при необходимости прикрепите фото или видео.",
  "Я отправлю ваш пост на модерацию, и после проверки он появится в канале.",
  "",
  "━━━━━━━━━━━━━━━",
  "",
  "📜 ПРАВИЛА:",
  "",
  "🚫 Строго запрещено:",
  "❌ Оскорбления и флейм",
  "❌ Политика и провокации",
  "❌ Спам и реклама без согласования",
  "❌ Флуд и бессмысленные сообщения",
  "❌ Контент 18+",
  "❌ Публикации о продаже или покупке товаров",
  "",
  "⚠️ Нарушение правил ведёт к предупреждению или бану без предупреждения"
].join("\n");

export const botCommands = [
  { command: "myref", description: "Моя ссылка для конкурса" },
  { command: "rules", description: "Правила анонимных сообщений" },
  { command: "info", description: "Информация о боте" }
];

export const rulesMessage = [
  "📜 ПРАВИЛА:",
  "",
  "🚫 Строго запрещено:",
  "❌ Оскорбления и флейм",
  "❌ Политика и провокации",
  "❌ Спам и реклама без согласования с администрацией",
  "❌ Флуд и бессмысленные сообщения",
  "❌ Контент 18+",
  "❌ Публикации, связанные с продажей или покупкой товаров",
  "",
  "⚠️ Нарушение правил ведёт к предупреждению или бану без предупреждения"
].join("\n");

export const infoMessage = [
  "Ищешь того самого незнакомца? 🤔",
  "Встретил(а) кого-то, но не решился(ась) подойти? 🥲",
  "Я помогу найти ⬇️⬇️⬇️",
  "",
  "Оставь здесь:",
  "1️⃣ Где?",
  "2️⃣ Когда?",
  "3️⃣ Как выглядел человек?",
  "",
  "📸 Можно прикреплять фото или видео: так шансы найти человека значительно выше."
].join("\n");
